org-content/ecology.org
#+hugo_base_dir: ../
#+hugo_section: ecology
* Chapter 1
:PROPERTIES:
:EXPORT_HUGO_SECTION*: ch1
:EXPORT_FILE_NAME: _index
:END:
** Terms
*** Ecology
The study of the interactions between an organism and its biological and physical environment.
*** Trait
A combination of characteristics in an individual. A trait that increases evolutionary fitness is an =adaptation=.
+ Hair color
+ resistance to antibiotics.
*** Population
All of the organisms of a particular species in a particular area.
+ The population of snow hares in the Himalayas.
*** Fitness
The degree to which an organism is likely to survive in an environment. The fitter the organism, the more likely they are to survive in an environment suited to their adaptations. This is more useful in the context of the population.
** Levels of Ecological organization
1. organism
2. population
3. community
4. ecosystem
** Proximate Vs Ultimate
*** Proximate Factors
Direct or Immediate causes/effects on the organism. The =How=.
+ Changes in photoperiod
+ Temperature changes
*** Ultimate Factors
The Indirect reason for an effect on the organism. The =Why=.

** Scientific Method and Hypothesis testing
Good hypothesis lead to testable =predictions=. It is also falsifiable.
1. Observation
2. Hypothesis
3. Measurements
4. Results
5. Conclusion
*** Predictions
A prediction is an observation or a result that is expected if the hypothesis is true.
*** Hypotheses and tests
+ Focus on a population
+ Why does the population exist?
+ What unique challenges does it face?
+ Are circumstances changing?
+ Will the population grow, shrink, disturbed
**** Resources
+ reproduction
+ Survival
+ Mate
+ Food
+ Shelter
