content/ecology/ch1/_index.md
+++
title = "Chapter 1"
author = ["David Lewis"]
draft = false
+++

## Terms {#terms}


### Ecology {#ecology}

The study of the interactions between an organism and its biological and physical environment.


### Trait {#trait}

A combination of characteristics in an individual. A trait that increases evolutionary fitness is an `adaptation`.

-   Hair color
-   resistance to antibiotics.


### Population {#population}

All of the organisms of a particular species in a particular area.

-   The population of snow hares in the Himalayas.


### Fitness {#fitness}

The degree to which an organism is likely to survive in an environment. The fitter the organism, the more likely they are to survive in an environment suited to their adaptations. This is more useful in the context of the population.


## Levels of Ecological organization {#levels-of-ecological-organization}

1.  organism
2.  population
3.  community
4.  ecosystem


## Proximate Vs Ultimate {#proximate-vs-ultimate}


### Proximate Factors {#proximate-factors}

Direct or Immediate causes/effects on the organism. The `How`.

-   Changes in photoperiod
-   Temperature changes


### Ultimate Factors {#ultimate-factors}

The Indirect reason for an effect on the organism. The `Why`.


## Scientific Method and Hypothesis testing {#scientific-method-and-hypothesis-testing}

Good hypothesis lead to testable `predictions`. It is also falsifiable.

1.  Observation
2.  Hypothesis
3.  Measurements
4.  Results
5.  Conclusion


### Predictions {#predictions}

A prediction is an observation or a result that is expected if the hypothesis is true.


### Hypotheses and tests {#hypotheses-and-tests}

-   Focus on a population
-   Why does the population exist?
-   What unique challenges does it face?
-   Are circumstances changing?
-   Will the population grow, shrink, disturbed


#### Resources {#resources}

-   reproduction
-   Survival
-   Mate
-   Food
-   Shelter

\*
